OpenNuvoton/M480BSP/Library/USB_Host/src_core/host/ohci-hcd.c
/*
 * Open Host Controller Interface (OHCI) driver for USB.
 *
 * Maintainer: Alan Stern <stern@rowland.harvard.edu>
 *
 * (C) Copyright 1999 Roman Weissgaerber <weissg@vienna.at>
 * (C) Copyright 2000-2004 David Brownell <dbrownell@users.sourceforge.net>
 *
 * [ Initialisation is based on Linus'  ]
 * [ uhci code and gregs ohci fragments ]
 * [ (C) Copyright 1999 Linus Torvalds  ]
 * [ (C) Copyright 1999 Gregory P. Smith]
 *
 *
 * OHCI is the main "non-Intel/VIA" standard for USB 1.1 host controller
 * interfaces (though some non-x86 Intel chips use it).  It supports
 * smarter hardware than UHCI.  A download link for the spec available
 * through the http://www.usb.org website.
 *
 * This file is licenced under the GPL.
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "M480.h"

#include "usb.h"


#define DRIVER_AUTHOR "Roman Weissgaerber, David Brownell"
#define DRIVER_DESC "USB 1.1 'Open' Host Controller (OHCI) Driver"

/*-------------------------------------------------------------------------*/

#undef OHCI_VERBOSE_DEBUG   /* not always helpful */

/* For initializing controller (mask in an HCFS mode too) */
#define OHCI_CONTROL_INIT   OHCI_CTRL_CBSR

#ifdef NUVOTON_PORTED
#define OHCI_INTR_INIT \
        (OHCI_INTR_MIE | OHCI_INTR_UE | OHCI_INTR_RD | OHCI_INTR_WDH)
#else
#define OHCI_INTR_INIT \
        (OHCI_INTR_MIE | OHCI_INTR_RHSC | OHCI_INTR_UE \
        | OHCI_INTR_RD | OHCI_INTR_WDH)
#endif

#ifdef __hppa__
/* On PA-RISC, PDC can leave IR set incorrectly; ignore it there. */
#define IR_DISABLE
#endif

#ifdef CONFIG_ARCH_OMAP
/* OMAP doesn't support IR (no SMM; not needed) */
#define IR_DISABLE
#endif

/*-------------------------------------------------------------------------*/

static const char   hcd_name [] = "ohci_hcd";

struct ohci_hcd  *g_m480_ohci;


#define STATECHANGE_DELAY   msecs_to_jiffies(300)

#include "ohci.h"
//#include "pci-quirks.h"

static void ohci_dump (struct ohci_hcd *ohci, int verbose);
static int ohci_init (struct usb_hcd *hcd);
static void ohci_stop (struct usb_hcd *hcd);

#if defined(CONFIG_PM) || defined(CONFIG_PCI)
static int ohci_restart (struct ohci_hcd *ohci);
#endif

//#ifdef CONFIG_PCI
//static void sb800_prefetch(struct ohci_hcd *ohci, int on);
//#else
//static inline void sb800_prefetch(struct ohci_hcd *ohci, int on)
//{
//  return;
//}
//#endif


#include "ohci-hub.c"
#include "ohci-dbg.c"
#include "ohci-mem.c"
#include "ohci-q.c"


#ifdef __ICCARM__
#pragma data_alignment=256
__u8 _HCCA_Block[256];
#else
__align(256) __u8 _HCCA_Block[256];
#endif



/*
 * On architectures with edge-triggered interrupts we must never return
 * IRQ_NONE.
 */
#if defined(CONFIG_SA1111)  /* ... or other edge-triggered systems */
#define IRQ_NOTMINE IRQ_HANDLED
#else
#define IRQ_NOTMINE IRQ_NONE
#endif


/* Some boards misreport power switching/overcurrent */
static int distrust_firmware = 1;
//module_param (distrust_firmware, bool, 0);
//MODULE_PARM_DESC (distrust_firmware,
//  "true to distrust firmware power/overcurrent setup");

/* Some boards leave IR set wrongly, since they fail BIOS/SMM handshakes */
static int no_handshake = 0;
//module_param (no_handshake, bool, 0);
//MODULE_PARM_DESC (no_handshake, "true (not default) disables BIOS handshake");

/*-------------------------------------------------------------------------*/

/*
 * queue up an urb for anything except the root hub
 */
static int ohci_urb_enqueue (
    struct usb_hcd  *hcd,
    struct urb  *urb,
    gfp_t       mem_flags
)
{
    struct ohci_hcd *ohci;
    struct ed   *ed;
    urb_priv_t  *urb_priv;
    unsigned int    pipe;
    int     i, size = 0;
    //unsigned long flags;
    int     retval = 0;

    ohci = hcd_to_ohci (hcd);
    pipe = urb->pipe;

#ifdef OHCI_VERBOSE_DEBUG
    urb_print(urb, "SUB", usb_pipein(pipe), -EINPROGRESS);
#endif

    /* every endpoint has a ed, locate and maybe (re)initialize it */
    ed = ed_get (ohci, urb->ep, urb->dev, pipe, urb->interval);
    if (!ed)
        return -ENOMEM;

    /* for the private part of the URB we need the number of TDs (size) */
    switch (ed->type) {
    case PIPE_CONTROL:
        /* td_submit_urb() doesn't yet handle these */
        if (urb->transfer_buffer_length > 4096)
            return -EMSGSIZE;

        /* 1 TD for setup, 1 for ACK, plus ... */
        size = 2;
    /* FALLTHROUGH */
    // case PIPE_INTERRUPT:
    // case PIPE_BULK:
    default:
        /* one TD for every 4096 Bytes (can be up to 8K) */
        size += urb->transfer_buffer_length / 4096;
        /* ... and for any remaining bytes ... */
        if ((urb->transfer_buffer_length % 4096) != 0)
            size++;
        /* ... and maybe a zero length packet to wrap it up */
        if (size == 0)
            size++;
        else if ((urb->transfer_flags & URB_ZERO_PACKET) != 0
                 && (urb->transfer_buffer_length
                     % usb_maxpacket (urb->dev, pipe,
                                      usb_pipeout (pipe))) == 0)
            size++;
        break;
    case PIPE_ISOCHRONOUS: /* number of packets from URB */
        size = urb->number_of_packets;
        break;
    }

    /* allocate the private part of the URB */
    urb_priv = kzalloc (sizeof (urb_priv_t) + size * sizeof (struct td *),
                        mem_flags);
    if (!urb_priv)
        return -ENOMEM;
    INIT_LIST_HEAD (&urb_priv->pending);
    urb_priv->length = size;
    urb_priv->ed = ed;

    /* allocate the TDs (deferring hash chain updates) */
    for (i = 0; i < size; i++) {
        urb_priv->td [i] = td_alloc (ohci, mem_flags);
        if (!urb_priv->td [i]) {
            urb_priv->length = i;
            urb_free_priv (ohci, urb_priv);
            return -ENOMEM;
        }
    }

    spin_lock_irqsave (&ohci->lock, flags);

    /* don't submit to a dead HC */
    if (!HCD_HW_ACCESSIBLE(hcd)) {
        retval = -ENODEV;
        goto fail;
    }
    if (!HC_IS_RUNNING(hcd->state)) {
        retval = -ENODEV;
        goto fail;
    }
    retval = usb_hcd_link_urb_to_ep(hcd, urb);
    if (retval)
        goto fail;

