OpenNuvoton/M480BSP/Library/USB_Host/src_core/host/ohci-hcd.c
    /* schedule the ed if needed */
    if (ed->state == ED_IDLE) {
        retval = ed_schedule (ohci, ed);
        if (retval < 0) {
            usb_hcd_unlink_urb_from_ep(hcd, urb);
            goto fail;
        }
        if (ed->type == PIPE_ISOCHRONOUS) {
            u16 frame = ohci_frame_no(ohci);

            /* delay a few frames before the first TD */
            //frame += max_t (u16, 8, ed->interval);
            {
                u16 __max1 = (8);
                u16 __max2 = (ed->interval);
                frame += (__max1 > __max2 ? __max1: __max2);
            }

            frame &= ~(ed->interval - 1);
            frame |= ed->branch;
            urb->start_frame = frame;

            /* yes, only URB_ISO_ASAP is supported, and
             * urb->start_frame is never used as input.
             */
        }
    } else if (ed->type == PIPE_ISOCHRONOUS)
        urb->start_frame = ed->last_iso + ed->interval;

    /* fill the TDs and link them to the ed; and
     * enable that part of the schedule, if needed
     * and update count of queued periodic urbs
     */
    urb->hcpriv = urb_priv;
    td_submit_urb (ohci, urb);

fail:
    if (retval)
        urb_free_priv (ohci, urb_priv);
    spin_unlock_irqrestore (&ohci->lock, flags);
    return retval;
}

/*
 * decouple the URB from the HC queues (TDs, urb_priv).
 * reporting is always done
 * asynchronously, and we might be dealing with an urb that's
 * partially transferred, or an ED with other urbs being unlinked.
 */
static int ohci_urb_dequeue(struct usb_hcd *hcd, struct urb *urb, int status)
{
    struct ohci_hcd     *ohci;
    //unsigned long     flags;
    int         rc;

    ohci = hcd_to_ohci (hcd);

#ifdef OHCI_VERBOSE_DEBUG
    urb_print(urb, "UNLINK", 1, status);
#endif

    spin_lock_irqsave (&ohci->lock, flags);
    rc = usb_hcd_check_unlink_urb(hcd, urb, status);
    if (rc) {
        ;   /* Do nothing */
    } else if (HC_IS_RUNNING(hcd->state)) {
        urb_priv_t  *urb_priv;

        /* Unless an IRQ completed the unlink while it was being
         * handed to us, flag it for unlink and giveback, and force
         * some upcoming INTR_SF to call finish_unlinks()
         */
        urb_priv = urb->hcpriv;
        if (urb_priv) {
            if (urb_priv->ed->state == ED_OPER)
                start_ed_unlink (ohci, urb_priv->ed);
        }
    } else {
        /*
         * with HC dead, we won't respect hc queue pointers
         * any more ... just clean up every urb's memory.
         */
        if (urb->hcpriv)
            finish_urb(ohci, urb, status);
    }
    spin_unlock_irqrestore (&ohci->lock, flags);
    return rc;
}

/*-------------------------------------------------------------------------*/

/* frees config/altsetting state for endpoints,
 * including ED memory, dummy TD, and bulk/intr data toggle
 */

static void
ohci_endpoint_disable (struct usb_hcd *hcd, struct usb_host_endpoint *ep)
{
    struct ohci_hcd *ohci;
    //unsigned long flags;
    struct ed       *ed;
    unsigned        limit = 50000;

    ohci = hcd_to_ohci (hcd);
    ed = ep->hcpriv;

    /* ASSERT:  any requests/urbs are being unlinked */
    /* ASSERT:  nobody can be submitting urbs for this any more */

    if (!ed)
        return;

rescan:
    spin_lock_irqsave (&ohci->lock, flags);

    if (!HC_IS_RUNNING (hcd->state)) {
sanitize:
        ed->state = ED_IDLE;
        //if (quirk_zfmicro(ohci) && ed->type == PIPE_INTERRUPT)
        //  ohci->eds_scheduled--;
        finish_unlinks (ohci, 0);
    }

    switch (ed->state) {
    case ED_UNLINK:     /* wait for hw to finish? */
        /* major IRQ delivery trouble loses INTR_SF too... */
        if (limit-- == 0) {
            USB_error("ED unlink timeout\n");
            //if (quirk_zfmicro(ohci)) {
            //  ohci_warn(ohci, "Attempting ZF TD recovery\n");
            //  ohci->ed_to_check = ed;
            //  ohci->zf_delay = 2;
            //}
            goto sanitize;
        }
        spin_unlock_irqrestore (&ohci->lock, flags);
        //schedule_timeout_uninterruptible(1);
        goto rescan;
    case ED_IDLE:       /* fully unlinked */
        if (list_empty (&ed->td_list)) {
            td_free (ohci, ed->dummy);
            ed_free (ohci, ed);
            break;
        }
    /* else FALL THROUGH */
    default:
        /* caller was supposed to have unlinked any requests;
         * that's not our job.  can't recover; must leak ed.
         */
        USB_error("leak ed %p (#%02x) state %d%s\n",
                  ed, ep->desc.bEndpointAddress, ed->state,
                  list_empty (&ed->td_list) ? "" : " (has tds)");
        td_free (ohci, ed->dummy);
        break;
    }
    ep->hcpriv = NULL;
    spin_unlock_irqrestore (&ohci->lock, flags);
}

static int ohci_get_frame (struct usb_hcd *hcd)
{
    struct ohci_hcd *ohci;

    ohci = hcd_to_ohci (hcd);

    return ohci_frame_no(ohci);
}

static void ohci_usb_reset (struct ohci_hcd *ohci)
{
    ohci->hc_control = ohci_readl (ohci, &ohci->regs->control);
    ohci->hc_control &= OHCI_CTRL_RWC;
    ohci_writel (ohci, ohci->hc_control, &ohci->regs->control);
}

#if 0
/* ohci_shutdown forcibly disables IRQs and DMA, helping kexec and
 * other cases where the next software may expect clean state from the
 * "firmware".  this is bus-neutral, unlike shutdown() methods.
 */
static void ohci_shutdown (struct usb_hcd *hcd)
{
    struct ohci_hcd *ohci;

    ohci = hcd_to_ohci (hcd);
    ohci_writel(ohci, (u32) ~0, &ohci->regs->intrdisable);

    /* Software reset, after which the controller goes into SUSPEND */
    ohci_writel(ohci, OHCI_HCR, &ohci->regs->cmdstatus);
    ohci_readl(ohci, &ohci->regs->cmdstatus);   /* flush the writes */
    udelay(10);

    ohci_writel(ohci, ohci->fminterval, &ohci->regs->fminterval);
}
#endif

#if 0
static int check_ed(struct ohci_hcd *ohci, struct ed *ed)
{
    return (hc32_to_cpu(ohci, ed->hwINFO) & ED_IN) != 0
           && (hc32_to_cpu(ohci, ed->hwHeadP) & TD_MASK)
           == (hc32_to_cpu(ohci, ed->hwTailP) & TD_MASK)
           && !list_empty(&ed->td_list);
}
#endif

/* ZF Micro watchdog timer callback. The ZF Micro chipset sometimes completes
 * an interrupt TD but neglects to add it to the donelist.  On systems with
 * this chipset, we need to periodically check the state of the queues to look
 * for such "lost" TDs.
 */
#if 0
static void unlink_watchdog_func(unsigned long _ohci)
{
    unsigned long   flags;
    unsigned    max;
    unsigned    seen_count = 0;
    unsigned    i;
    struct ed   **seen = NULL;
    struct ohci_hcd *ohci;

    ohci = (struct ohci_hcd *) _ohci;

    spin_lock_irqsave(&ohci->lock, flags);
    max = ohci->eds_scheduled;
    if (!max)
        goto done;

