OpenNuvoton/M480BSP/Library/USB_Host/src_core/host/ohci-hcd.c
    //if (ohci->ed_to_check)
    //  goto out;

    seen = kcalloc(max, sizeof *seen, GFP_ATOMIC);
    if (!seen)
        goto out;

    for (i = 0; i < NUM_INTS; i++) {
        struct ed   *ed = ohci->periodic[i];

        while (ed) {
            unsigned    temp;

            /* scan this branch of the periodic schedule tree */
            for (temp = 0; temp < seen_count; temp++) {
                if (seen[temp] == ed) {
                    /* we've checked it and what's after */
                    ed = NULL;
                    break;
                }
            }
            if (!ed)
                break;
            seen[seen_count++] = ed;
            if (!check_ed(ohci, ed)) {
                ed = ed->ed_next;
                continue;
            }

            /* HC's TD list is empty, but HCD sees at least one
             * TD that's not been sent through the donelist.
             */
            ohci->ed_to_check = ed;
            ohci->zf_delay = 2;

            /* The HC may wait until the next frame to report the
             * TD as done through the donelist and INTR_WDH.  (We
             * just *assume* it's not a multi-TD interrupt URB;
             * those could defer the IRQ more than one frame, using
             * DI...)  Check again after the next INTR_SF.
             */
            ohci_writel(ohci, OHCI_INTR_SF,
                        &ohci->regs->intrstatus);
            ohci_writel(ohci, OHCI_INTR_SF,
                        &ohci->regs->intrenable);

            /* flush those writes */
            (void) ohci_readl(ohci, &ohci->regs->control);

            goto out;
        }
    }
out:
    kfree(seen);
    //if (ohci->eds_scheduled)
    //  mod_timer(&ohci->unlink_watchdog, round_jiffies(jiffies + HZ));
done:
    spin_unlock_irqrestore(&ohci->lock, flags);
}
#endif


/*-------------------------------------------------------------------------*
 * HC functions
 *-------------------------------------------------------------------------*/

/* init memory, and kick BIOS/SMM off */

static int ohci_init (struct usb_hcd *hcd)
{
    struct ohci_hcd *ohci;

    ohci = hcd_to_ohci(hcd);
    g_m480_ohci = ohci;

    //USB_debug("ohci_init called...\n");

    if (distrust_firmware)
        ohci->flags |= OHCI_QUIRK_HUB_POWER;

    disable (ohci);
    ohci->regs = hcd->regs;

    /* REVISIT this BIOS handshake is now moved into PCI "quirks", and
     * was never needed for most non-PCI systems ... remove the code?
     */

#ifndef IR_DISABLE
    /* SMM owns the HC?  not for long! */
    if (!no_handshake && ohci_readl (ohci,
                                     &ohci->regs->control) & OHCI_CTRL_IR) {
        u32 temp;

        USB_debug("USB HC TakeOver from BIOS/SMM\n");

        /* this timeout is arbitrary.  we make it long, so systems
         * depending on usb keyboards may be usable even if the
         * BIOS/SMM code seems pretty broken.
         */
        temp = 500; /* arbitrary: five seconds */

        ohci_writel (ohci, OHCI_INTR_OC, &ohci->regs->intrenable);
        ohci_writel (ohci, OHCI_OCR, &ohci->regs->cmdstatus);
        while (ohci_readl (ohci, &ohci->regs->control) & OHCI_CTRL_IR) {
            msleep (10);
            if (--temp == 0) {
                USB_error("USB HC takeover failed (BIOS/SMM bug)\n");
                return -EBUSY;
            }
        }
        ohci_usb_reset (ohci);
    }
#endif

    /* Disable HC interrupts */
    ohci_writel (ohci, OHCI_INTR_MIE, &ohci->regs->intrdisable);

    /* flush the writes, and save key bits like RWC */
    if (ohci_readl (ohci, &ohci->regs->control) & OHCI_CTRL_RWC)
        ohci->hc_control |= OHCI_CTRL_RWC;

    /* Read the number of ports unless overridden */
    if (ohci->num_ports == 0)
        ohci->num_ports = roothub_a(ohci) & RH_A_NDP;

    //ohci->hcca = dma_alloc_coherent (hcd->self.controller,
    //      sizeof *ohci->hcca, &ohci->hcca_dma, 0);
    //if (!ohci->hcca)
    //  return -ENOMEM;
    ohci->hcca = (struct ohci_hcca *)((__u32)(&_HCCA_Block[0]) | NON_CACHE_MASK);
    ohci->hcca_dma = (__u32)ohci->hcca;

    create_debug_files (ohci);

    return 0;
}

/*-------------------------------------------------------------------------*/

/* Start an OHCI controller, set the BUS operational
 * resets USB and controller
 * enable interrupts
 */
static int ohci_run (struct usb_hcd *hcd)
{
    u32         mask, val;
    int         first;
    struct ohci_hcd *ohci;

    ohci = hcd_to_ohci(hcd);

    first = ohci->fminterval == 0;

    disable (ohci);

    /* boot firmware should have set this up (5.1.1.3.1) */
    if (first) {

        val = ohci_readl (ohci, &ohci->regs->fminterval);
        ohci->fminterval = val & 0x3fff;
        if (ohci->fminterval != FI)
            USB_debug("fminterval delta %d\n", ohci->fminterval - FI);
        ohci->fminterval |= FSMP (ohci->fminterval) << 16;
        /* also: power/overcurrent flags in roothub.a */
    }

    /* Reset USB nearly "by the book".  RemoteWakeupConnected has
     * to be checked in case boot firmware (BIOS/SMM/...) has set up
     * wakeup in a way the bus isn't aware of (e.g., legacy PCI PM).
     * If the bus glue detected wakeup capability then it should
     * already be enabled; if so we'll just enable it again.
     */
    //if ((ohci->hc_control & OHCI_CTRL_RWC) != 0)
    //  device_set_wakeup_capable(hcd->self.controller, 1);

    switch (ohci->hc_control & OHCI_CTRL_HCFS) {
    case OHCI_USB_OPER:
        val = 0;
        break;
    case OHCI_USB_SUSPEND:
    case OHCI_USB_RESUME:
        ohci->hc_control &= OHCI_CTRL_RWC;
        ohci->hc_control |= OHCI_USB_RESUME;
        val = 10 /* msec wait */;
        break;
    // case OHCI_USB_RESET:
    default:
        ohci->hc_control &= OHCI_CTRL_RWC;
        ohci->hc_control |= OHCI_USB_RESET;
        val = 50 /* msec wait */;
        break;
    }
    ohci_writel (ohci, ohci->hc_control, &ohci->regs->control);
    // flush the writes
    (void) ohci_readl (ohci, &ohci->regs->control);
    //msleep(val);

    memset (ohci->hcca, 0, sizeof (struct ohci_hcca));

    /* 2msec timelimit here means no irqs/preempt */
    spin_lock_irq (&ohci->lock);

