OpenNuvoton/M480BSP/Library/USB_Host/src_core/host/ohci-hcd.c
retry:
    /* HC Reset requires max 10 us delay */
    ohci_writel (ohci, OHCI_HCR,  &ohci->regs->cmdstatus);
    val = 30;   /* ... allow extra time */
    while ((ohci_readl (ohci, &ohci->regs->cmdstatus) & OHCI_HCR) != 0) {
        if (--val == 0) {
            spin_unlock_irq (&ohci->lock);
            USB_error("USB HC reset timed out!\n");
            return -1;
        }
        udelay (1);
    }

    /* now we're in the SUSPEND state ... must go OPERATIONAL
     * within 2msec else HC enters RESUME
     *
     * ... but some hardware won't init fmInterval "by the book"
     * (SiS, OPTi ...), so reset again instead.  SiS doesn't need
     * this if we write fmInterval after we're OPERATIONAL.
     * Unclear about ALi, ServerWorks, and others ... this could
     * easily be a longstanding bug in chip init on Linux.
     */
    if (ohci->flags & OHCI_QUIRK_INITRESET) {
        ohci_writel (ohci, ohci->hc_control, &ohci->regs->control);
        // flush those writes
        (void) ohci_readl (ohci, &ohci->regs->control);
    }

    /* Tell the controller where the control and bulk lists are
     * The lists are empty now. */
    ohci_writel (ohci, 0, &ohci->regs->ed_controlhead);
    ohci_writel (ohci, 0, &ohci->regs->ed_bulkhead);

    /* a reset clears this */
    ohci_writel (ohci, (u32) ohci->hcca_dma, &ohci->regs->hcca);

    periodic_reinit (ohci);

    /* some OHCI implementations are finicky about how they init.
     * bogus values here mean not even enumeration could work.
     */
    if ((ohci_readl (ohci, &ohci->regs->fminterval) & 0x3fff0000) == 0
            || !ohci_readl (ohci, &ohci->regs->periodicstart)) {
        if (!(ohci->flags & OHCI_QUIRK_INITRESET)) {
            ohci->flags |= OHCI_QUIRK_INITRESET;
            USB_vdebug("enabling initreset quirk\n");
            goto retry;
        }
        spin_unlock_irq (&ohci->lock);
        USB_error("init err (0x%08x 0x%04x)\n",
                  ohci_readl (ohci, &ohci->regs->fminterval),
                  ohci_readl (ohci, &ohci->regs->periodicstart));
        return -EOVERFLOW;
    }

    /* use rhsc irqs after khubd is fully initialized */
    set_bit(HCD_FLAG_POLL_RH, &hcd->flags);
    hcd->uses_new_polling = 1;

    /* start controller operations */
    ohci->hc_control &= OHCI_CTRL_RWC;
    ohci->hc_control |= OHCI_CONTROL_INIT | OHCI_USB_OPER;
    ohci_writel (ohci, ohci->hc_control, &ohci->regs->control);
    hcd->state = HC_STATE_RUNNING;

    /* wake on ConnectStatusChange, matching external hubs */
    ohci_writel (ohci, RH_HS_DRWE, &ohci->regs->roothub.status);

    /* Choose the interrupts we care about now, others later on demand */
    mask = OHCI_INTR_INIT;
    ohci_writel (ohci, ~0, &ohci->regs->intrstatus);
    ohci_writel (ohci, mask, &ohci->regs->intrenable);

    /* handle root hub init quirks ... */
    val = roothub_a (ohci);
    val &= ~(RH_A_PSM | RH_A_OCPM);
    if (ohci->flags & OHCI_QUIRK_SUPERIO) {
        /* NSC 87560 and maybe others */
        val |= RH_A_NOCP;
        val &= ~(RH_A_POTPGT | RH_A_NPS);
        ohci_writel (ohci, val, &ohci->regs->roothub.a);
    } else if ((ohci->flags & OHCI_QUIRK_AMD756) ||
               (ohci->flags & OHCI_QUIRK_HUB_POWER)) {
        /* hub power always on; required for AMD-756 and some
         * Mac platforms.  ganged overcurrent reporting, if any.
         */
        val |= RH_A_NPS;
        ohci_writel (ohci, val, &ohci->regs->roothub.a);
    }

    mdelay(100);  // YCHuang - 2016.05.03, a few delay is necessary

    ohci_writel (ohci, RH_HS_LPSC, &ohci->regs->roothub.status);
    ohci_writel (ohci, (val & RH_A_NPS) ? 0 : RH_B_PPCM,
                 &ohci->regs->roothub.b);

    ohci->next_statechange = jiffies + STATECHANGE_DELAY;
    spin_unlock_irq (&ohci->lock);

    // POTPGT delay is bits 24-31, in 2 ms units.
    mdelay_in_isr ((val >> 23) & 0x1fe);
    hcd->state = HC_STATE_RUNNING;

    //if (quirk_zfmicro(ohci)) {
    //  /* Create timer to watch for bad queue state on ZF Micro */
    //  setup_timer(&ohci->unlink_watchdog, unlink_watchdog_func,
    //          (unsigned long) ohci);
    //  ohci->eds_scheduled = 0;
    //  ohci->ed_to_check = NULL;
    //}

    //ohci_dump (ohci, 1);

    return 0;
}

/*-------------------------------------------------------------------------*/

/* an interrupt happens */

//static irqreturn_t ohci_irq (struct usb_hcd *hcd)
void OHCI_IRQHandler(struct usb_hcd *hcd)
{
    struct ohci_hcd *ohci;
    struct ohci_regs __iomem *regs;
    int         ints;

    _IsInUsbInterrupt = 1;
    ohci = g_m480_ohci;
    hcd = ohci_to_hcd(ohci);
    regs = ohci->regs;

    /* Read interrupt status (and flush pending writes).  We ignore the
     * optimization of checking the LSB of hcca->done_head; it doesn't
     * work on all systems (edge triggering for OHCI can be a factor).
     */
    ints = ohci_readl(ohci, &regs->intrstatus);

    //USB_debug("ohci_irq ints = 0x%x\n", ints);

    /* Check for an all 1's result which is a typical consequence
     * of dead, unclocked, or unplugged (CardBus...) devices
     */
    if (ints == ~(u32)0) {
        disable (ohci);
        USB_debug("device removed!\n");
        //usb_hc_died(hcd);
        _IsInUsbInterrupt = 0;
        return; // IRQ_HANDLED;
    }

    /* We only care about interrupts that are enabled */
    ints &= ohci_readl(ohci, &regs->intrenable);

    /* interrupt for some other device? */
    if (ints == 0 || unlikely(hcd->state == HC_STATE_HALT)) {
        _IsInUsbInterrupt = 0;
        return ; // IRQ_NOTMINE;
    }

    if (ints & OHCI_INTR_UE) {
        // e.g. due to PCI Master/Target Abort
        //if (quirk_nec(ohci)) {
        /* Workaround for a silicon bug in some NEC chips used
         * in Apple's PowerBooks. Adapted from Darwin code.
         */
        //USB_error("OHCI Unrecoverable Error, scheduling NEC chip restart\n");

        //ohci_writel (ohci, OHCI_INTR_UE, &regs->intrdisable);

        //schedule_work (&ohci->nec_work);
        //} else
        {
            disable (ohci);
            USB_error("OHCI Unrecoverable Error, disabled\n");
            //usb_hc_died(hcd);
        }

        ohci_dump (ohci, 1);
        ohci_usb_reset (ohci);
    }

