OpenNuvoton/M480BSP/Library/USB_Host/src_core/host/ohci-hcd.c
    if (ints & OHCI_INTR_RHSC) {
        USB_vdebug("OHCI RHSC\n");
        ohci->next_statechange = jiffies + STATECHANGE_DELAY;
        ohci_writel(ohci, OHCI_INTR_RD | OHCI_INTR_RHSC,
                    &regs->intrstatus);

        /* NOTE: Vendors didn't always make the same implementation
         * choices for RHSC.  Many followed the spec; RHSC triggers
         * on an edge, like setting and maybe clearing a port status
         * change bit.  With others it's level-triggered, active
         * until khubd clears all the port status change bits.  We'll
         * always disable it here and rely on polling until khubd
         * re-enables it.
         */
        ohci_writel(ohci, OHCI_INTR_RHSC, &regs->intrdisable);
        usb_hcd_poll_rh_status(hcd);
    }

    /* For connect and disconnect events, we expect the controller
     * to turn on RHSC along with RD.  But for remote wakeup events
     * this might not happen.
     */
    else if (ints & OHCI_INTR_RD) {
        USB_vdebug("resume detect\n");
        ohci_writel(ohci, OHCI_INTR_RD, &regs->intrstatus);
        set_bit(HCD_FLAG_POLL_RH, &hcd->flags);
        if (ohci->autostop) {
            spin_lock (&ohci->lock);
            ohci_rh_resume (ohci);
            spin_unlock (&ohci->lock);
        } else
            usb_hcd_resume_root_hub(hcd);
    }

    if (ints & OHCI_INTR_WDH) {
        spin_lock (&ohci->lock);
        dl_done_list (ohci);
        spin_unlock (&ohci->lock);
    }

#if 0
    if (quirk_zfmicro(ohci) && (ints & OHCI_INTR_SF)) {
        spin_lock(&ohci->lock);
        if (ohci->ed_to_check) {
            struct ed *ed = ohci->ed_to_check;

            if (check_ed(ohci, ed)) {
                /* HC thinks the TD list is empty; HCD knows
                 * at least one TD is outstanding
                 */
                if (--ohci->zf_delay == 0) {
                    struct td *td = list_entry(
                                        ed->td_list.next,
                                        struct td, td_list);
                    USB_error("Reclaiming orphan TD %p\n", td);
                    takeback_td(ohci, td);
                    ohci->ed_to_check = NULL;
                }
            } else
                ohci->ed_to_check = NULL;
        }
        spin_unlock(&ohci->lock);
    }
#endif

    /* could track INTR_SO to reduce available PCI/... bandwidth */

    /* handle any pending URB/ED unlinks, leaving INTR_SF enabled
     * when there's still unlinking to be done (next frame).
     */
    spin_lock (&ohci->lock);
    if (ohci->ed_rm_list)
        finish_unlinks (ohci, ohci_frame_no(ohci));
    if ((ints & OHCI_INTR_SF) != 0
            && !ohci->ed_rm_list
            // && !ohci->ed_to_check
            && HC_IS_RUNNING(hcd->state))
        ohci_writel (ohci, OHCI_INTR_SF, &regs->intrdisable);
    spin_unlock (&ohci->lock);

    if (HC_IS_RUNNING(hcd->state)) {
        ohci_writel (ohci, ints, &regs->intrstatus);
        ohci_writel (ohci, OHCI_INTR_MIE, &regs->intrenable);
        // flush those writes
        (void) ohci_readl (ohci, &ohci->regs->control);
    }
    _IsInUsbInterrupt = 0;
    return ; // IRQ_HANDLED;
}

/*-------------------------------------------------------------------------*/

static void ohci_stop (struct usb_hcd *hcd)
{
    struct ohci_hcd *ohci;

    ohci = hcd_to_ohci (hcd);

    ohci_dump (ohci, 1);

    //if (quirk_nec(ohci))
    //  flush_work_sync(&ohci->nec_work);

    ohci_usb_reset (ohci);
    ohci_writel (ohci, OHCI_INTR_MIE, &ohci->regs->intrdisable);
    //free_irq(hcd->irq, hcd);
    //hcd->irq = -1;

    //if (quirk_zfmicro(ohci))
    //  del_timer(&ohci->unlink_watchdog);
    //if (quirk_amdiso(ohci))
    //  usb_amd_dev_put();

    remove_debug_files (ohci);

    if (ohci->hcca) {
        //dma_free_coherent (hcd->self.controller,
        //      sizeof *ohci->hcca,
        //      ohci->hcca, ohci->hcca_dma);
        ohci->hcca = NULL;
        ohci->hcca_dma = 0;
    }
}

/*-------------------------------------------------------------------------*/

#if defined(CONFIG_PM) || defined(CONFIG_PCI)

/* must not be called from interrupt context */
static int ohci_restart (struct ohci_hcd *ohci)
{
    int temp;
    int i;
    struct urb_priv *priv;

    USB_debug("ohci_restart called...\n");

    spin_lock_irq(&ohci->lock);
    disable (ohci);

    /* Recycle any "live" eds/tds (and urbs). */
    if (!list_empty (&ohci->pending))
        USB_debug("abort schedule...\n");
    list_for_each_entry (priv, &ohci->pending, pending) {
        struct urb  *urb = priv->td[0]->urb;
        struct ed   *ed = priv->ed;

        switch (ed->state) {
        case ED_OPER:
            ed->state = ED_UNLINK;
            ed->hwINFO |= cpu_to_hc32(ohci, ED_DEQUEUE);
            ed_deschedule (ohci, ed);

            ed->ed_next = ohci->ed_rm_list;
            ed->ed_prev = NULL;
            ohci->ed_rm_list = ed;
        /* FALLTHROUGH */
        case ED_UNLINK:
            break;
        default:
            USB_debug("bogus ed %p state %d\n", ed, ed->state);
        }

        if (!urb->unlinked)
            urb->unlinked = -ESHUTDOWN;
    }
    finish_unlinks (ohci, 0);
    spin_unlock_irq(&ohci->lock);

    /* paranoia, in case that didn't work: */

    /* empty the interrupt branches */
    for (i = 0; i < NUM_INTS; i++) ohci->load [i] = 0;
    for (i = 0; i < NUM_INTS; i++) ohci->hcca->int_table [i] = 0;

    /* no EDs to remove */
    ohci->ed_rm_list = NULL;

    /* empty control and bulk lists */
    ohci->ed_controltail = NULL;
    ohci->ed_bulktail    = NULL;

    if ((temp = ohci_run (ohci_to_hcd(hcd))) < 0) {
        USB_error("can't restart, %d\n", temp);
        return temp;
    }
    USB_debug("restart complete\n");
    return 0;
}

#endif

/*-------------------------------------------------------------------------*/


#include "ohci-m480.c"

#if 0
static int __init ohci_hcd_mod_init(void)
{
    int retval = 0;

    if (usb_disabled())
        return -ENODEV;

    printk(KERN_INFO "%s: " DRIVER_DESC "\n", hcd_name);
    pr_debug ("%s: block sizes: ed %Zd td %Zd\n", hcd_name,
              sizeof (struct ed), sizeof (struct td));
    set_bit(USB_OHCI_LOADED, &usb_hcds_loaded);

#ifdef DEBUG
    ohci_debug_root = debugfs_create_dir("ohci", usb_debug_root);
    if (!ohci_debug_root) {
        retval = -ENOENT;
        goto error_debug;
    }
#endif

#ifdef PS3_SYSTEM_BUS_DRIVER
    retval = ps3_ohci_driver_register(&PS3_SYSTEM_BUS_DRIVER);
    if (retval < 0)
        goto error_ps3;
#endif

