OpenNuvoton/M480BSP/Library/USB_Host/src_core/host/ohci-hcd.c
#ifdef PLATFORM_DRIVER
    retval = platform_driver_register(&PLATFORM_DRIVER);
    if (retval < 0)
        goto error_platform;
#endif

#ifdef OMAP1_PLATFORM_DRIVER
    retval = platform_driver_register(&OMAP1_PLATFORM_DRIVER);
    if (retval < 0)
        goto error_omap1_platform;
#endif

#ifdef OMAP3_PLATFORM_DRIVER
    retval = platform_driver_register(&OMAP3_PLATFORM_DRIVER);
    if (retval < 0)
        goto error_omap3_platform;
#endif

#ifdef OF_PLATFORM_DRIVER
    retval = platform_driver_register(&OF_PLATFORM_DRIVER);
    if (retval < 0)
        goto error_of_platform;
#endif

#ifdef SA1111_DRIVER
    retval = sa1111_driver_register(&SA1111_DRIVER);
    if (retval < 0)
        goto error_sa1111;
#endif

#ifdef PCI_DRIVER
    retval = pci_register_driver(&PCI_DRIVER);
    if (retval < 0)
        goto error_pci;
#endif

#ifdef SSB_OHCI_DRIVER
    retval = ssb_driver_register(&SSB_OHCI_DRIVER);
    if (retval)
        goto error_ssb;
#endif

#ifdef SM501_OHCI_DRIVER
    retval = platform_driver_register(&SM501_OHCI_DRIVER);
    if (retval < 0)
        goto error_sm501;
#endif

#ifdef TMIO_OHCI_DRIVER
    retval = platform_driver_register(&TMIO_OHCI_DRIVER);
    if (retval < 0)
        goto error_tmio;
#endif

    return retval;

    /* Error path */
#ifdef TMIO_OHCI_DRIVER
    platform_driver_unregister(&TMIO_OHCI_DRIVER);
error_tmio:
#endif
#ifdef SM501_OHCI_DRIVER
    platform_driver_unregister(&SM501_OHCI_DRIVER);
error_sm501:
#endif
#ifdef SSB_OHCI_DRIVER
    ssb_driver_unregister(&SSB_OHCI_DRIVER);
error_ssb:
#endif
#ifdef PCI_DRIVER
    pci_unregister_driver(&PCI_DRIVER);
error_pci:
#endif
#ifdef SA1111_DRIVER
    sa1111_driver_unregister(&SA1111_DRIVER);
error_sa1111:
#endif
#ifdef OF_PLATFORM_DRIVER
    platform_driver_unregister(&OF_PLATFORM_DRIVER);
error_of_platform:
#endif
#ifdef PLATFORM_DRIVER
    platform_driver_unregister(&PLATFORM_DRIVER);
error_platform:
#endif
#ifdef OMAP1_PLATFORM_DRIVER
    platform_driver_unregister(&OMAP1_PLATFORM_DRIVER);
error_omap1_platform:
#endif
#ifdef OMAP3_PLATFORM_DRIVER
    platform_driver_unregister(&OMAP3_PLATFORM_DRIVER);
error_omap3_platform:
#endif
#ifdef PS3_SYSTEM_BUS_DRIVER
    ps3_ohci_driver_unregister(&PS3_SYSTEM_BUS_DRIVER);
error_ps3:
#endif
#ifdef DEBUG
    debugfs_remove(ohci_debug_root);
    ohci_debug_root = NULL;
error_debug:
#endif

    clear_bit(USB_OHCI_LOADED, &usb_hcds_loaded);
    return retval;
}
module_init(ohci_hcd_mod_init);

static void __exit ohci_hcd_mod_exit(void)
{
#ifdef TMIO_OHCI_DRIVER
    platform_driver_unregister(&TMIO_OHCI_DRIVER);
#endif
#ifdef SM501_OHCI_DRIVER
    platform_driver_unregister(&SM501_OHCI_DRIVER);
#endif
#ifdef SSB_OHCI_DRIVER
    ssb_driver_unregister(&SSB_OHCI_DRIVER);
#endif
#ifdef PCI_DRIVER
    pci_unregister_driver(&PCI_DRIVER);
#endif
#ifdef SA1111_DRIVER
    sa1111_driver_unregister(&SA1111_DRIVER);
#endif
#ifdef OF_PLATFORM_DRIVER
    platform_driver_unregister(&OF_PLATFORM_DRIVER);
#endif
#ifdef PLATFORM_DRIVER
    platform_driver_unregister(&PLATFORM_DRIVER);
#endif
#ifdef OMAP3_PLATFORM_DRIVER
    platform_driver_unregister(&OMAP3_PLATFORM_DRIVER);
#endif
#ifdef PS3_SYSTEM_BUS_DRIVER
    ps3_ohci_driver_unregister(&PS3_SYSTEM_BUS_DRIVER);
#endif
#ifdef DEBUG
    debugfs_remove(ohci_debug_root);
#endif
    clear_bit(USB_OHCI_LOADED, &usb_hcds_loaded);
}
module_exit(ohci_hcd_mod_exit);
#endif
